# Close Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..Close Method
UIView Class See Also
---
Closes the view.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void Close()
```

Visual Basic
---
```text
Public Sub Close
```

Visual C++
---
```text
public:
void Close()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Cannot close a project's only open view. |

# See Also
UIView Class
Autodesk.Revit.UI Namespace